[
    {
        "title": "Kiki's Delivery Service",
        "released": 1990,
        "rating": 7.9,
        "description": "In this anime feature, 13-year-old Kiki moves to a seaside town with her talking cat, Jiji, to spend a year alone, in accordance with her village's tradition for witches in training. After learning to control her broomstick, Kiki sets up a flying courier service and soon becomes a fixture in the community. But when the insecure young witch begins questioning herself and loses her magic abilities, she must overcome her self-doubt to get her powers back.",
        "id": "4bG17OYs-GA",
        "soundtrack": [
            {
                "name": "Town with an Ocean View",
                "by": "Joe Hisaishi",
                "id": "2ZJ28Rm7OXMYJshLtp5uff?si=4b4c21e3d65b4b2a"
            },
            {
                "name": "On a Clear Day",
                "by": "Joe Hisaishi",
                "id": "1P47jw1VxOTQ0MM6sGKCkP?si=154df33f810c4fda"
            }
        ]
    },
    {
        "title": "Ponyo",
        "released": 2008,
        "rating": 7.6,
        "description": "During a forbidden excursion to see the surface world, a goldfish princess encounters a human boy named Sosuke, who gives her the name Ponyo. Ponyo longs to become human, and as her friendship with Sosuke grows, she becomes more humanlike. Ponyo's father brings her back to their ocean kingdom, but so strong is Ponyo's wish to live on the surface that she breaks free, and in the process, spills a collection of magical elixirs that endanger Sosuke's village.",
        "id": "bskgNOXbdiE",
        "soundtrack": [
            {
                "name": "Ponyo on the Cliff by the Sea",
                "by": "Joe Hisaishi",
                "id": "35lqISXEocFzdX7JnuCAB6?si=efaf7730f6534669"
            },
            {
                "name": "Deep Sea Pastures",
                "by": "Joe Hisaishi",
                "id": "4F8yEnyAZOQHkgb3oW7xhu?si=2e7ece39b7754d7d"
            },
            {
                "name": "Mother Sea",
                "by": "Joe Hisaishi",
                "id": "5B937hdYn7ADYmErMxtRgJ?si=3ccff5aba41a4c63"
            }
        ]
    },
    {
        "title": "Howl's Moving Castle",
        "released": 2004,
        "rating": 8.2,
        "description": "Sophie (Emily Mortimer) has an uneventful life at her late father's hat shop, but all that changes when she befriends wizard Howl (Christian Bale), who lives in a magical flying castle. However, the evil Witch of Waste (Lauren Bacall) takes issue with their budding relationship and casts a spell on young Sophie, which ages her prematurely. Now Howl must use all his magical talents to battle the jealous hag and return Sophie to her former youth and beauty.",
        "id": "iwROgK94zcM",
        "soundtrack": [
            {
                "name": "Merry-Go-Round of Life",
                "by": "Joe Hisaishi",
                "id": "3cIKojC2JBVIno9b35MJWn?si=b5bc94de04474a2a"
            },
            {
                "name": "To Star Lake",
                "by": "Joe Hisaishi",
                "id": "10yjPJiEI1QC4fPJ561biy?si=aef150a89a214e46"
            }
        ]
    },
    {
        "title": "Castle in the Sky",
        "released": 1986,
        "rating": 8,
        "description": "Young orphan Sheeta and her kidnapper, Col. Muska, are flying to a military prison when their plane is attacked by a gang of air pirates led by the matronly Dola. Escaping from a mid-air collision via a magic crystal around her neck, Sheeta meets fellow orphan Pazu and the pair join forces to discover the mystical floating city of Laputa while pursued by both Muska and the pirates, who lust for the city's myriad treasures.",
        "id": "8ykEy-yPBFc",
        "soundtrack": [
            {
                "name": "The Girl Who Fell from the Sky",
                "by": "Joe Hisaishi",
                "id": "3uZBYoobTWc4bpxY0SqkK1?si=c70fb6129a7a4482"
            },
            {
                "name": "A Rowdy Brawl",
                "by": "Joe Hisaishi",
                "id": "4084Hbr188I963DUsVyhBX?si=50dd83918c6d43ff"
            },
            {
                "name": "On the Tiger Moth",
                "by": "Joe Hisaishi",
                "id": "1JdJXZUhJGuS1Ym8j2bKNU?si=5219ef90a9e1445f"
            }
        ]
    },
    {
        "title": "The Secret World of Arrietty",
        "released": 2010,
        "rating": 7.6,
        "description": "Arrietty, a tiny teenager, lives with her parents in the recesses of a suburban home, unbeknown to the homeowner and housekeeper. Like others of her kind, Arrietty remains hidden from her human hosts, but occasionally ventures forth from beneath the floorboards to borrow sugar cubes and other supplies. A secret friendship forms when 12-year-old Shawn meets Arrietty, but their relationship could spell danger for Arrietty's family.",
        "id": "VlMe7PavaRQ",
        "soundtrack": [
            {
                "name": "Arrietty's Song",
                "by": "Cécile Corbel",
                "id": "4F22XJWhfi1BHI0fOA9td6?si=809912e313fd4e49"
            }
        ]
    },
    {
        "title": "Spirited Away",
        "released": 2001,
        "rating": 8.6,
        "description": "In this animated feature by noted Japanese director Hayao Miyazaki, 10-year-old Chihiro (Rumi Hiiragi) and her parents (Takashi Naitô, Yasuko Sawaguchi) stumble upon a seemingly abandoned amusement park. After her mother and father are turned into giant pigs, Chihiro meets the mysterious Haku (Miyu Irino), who explains that the park is a resort for supernatural beings who need a break from their time spent in the earthly realm, and that she must work there to free herself and her parents.",
        "id": "ByXuk9QqQkk",
        "soundtrack": [
            {
                "name": "One Summer Day",
                "by": "Joe Hisaishi",
                "id": "3gFQOMoUwlR6aUZj81gCzu?si=8f2a06902ee6437b"
            },
            {
                "name": "Always with Me",
                "by": "Yumi Kimura",
                "id": "0FJL3Dwu8oUpwDb80qNdvP?si=3fd538c7b6734119"
            }
        ]
    }
]
